---
kind: method
id: M:Autodesk.Revit.DB.ViewSetIterator.#ctor
source: html/f31f08f1-6c01-563a-057f-8174885cc08d.htm
---
# Autodesk.Revit.DB.ViewSetIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public ViewSetIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.